Revit 2027 API
SchemaCommon.BaseSchema Property
 The property labeled "BaseSchema" common to all visual Asset types.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string BaseSchema { get; }
Public Shared ReadOnly Property BaseSchema As String
	Get
public:
static property String^ BaseSchema {
	String^ get ();
}
static member BaseSchema : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyString".
See Also
Reference
SchemaCommon Class
Autodesk.Revit.DB.Visual Namespace